Repository: Hynek-loc/game-localization-portfolio
Catalog: BG3 Nautiloid – EN → CZ Localization Sample.po
Languages: cs

source: The blood in your head thrums and pounds.
cs: Krev v hlavě ti pulzuje a buší.

source: Thet pounding blood obscures who you are. An overwhelming loss of memory.
cs: Ta bušící krev zakrývá kým jsi. Ohromná ztráta paměti.

source: How you ended up amidst these hellish flames is just as hidden.
cs: Jak jsi se ocitl uprostřed těchto pekelných plamenů, je stejně záhadné.

source: You have nothing in your skull, besides your name and a headache. But you are in danger.
cs: V hlavě nemáš nic, krom svého jména a bolesti. Ale jsi v nebezpečí.

source: Select
cs: Vybrat

source: Dialogue History
cs: Historie Rozhovorů

source: Take a deep breath, shake your head and start anew.
cs: Zhluboka se nadechni, zavrť hlavou a začni znovu.

source: Time to get out of here, and then you can shed light on the dark of the matter of yourself.
cs: Je čas se odtud dostat, a pak můžeš osvětlit temnou stránku své vlastní osoby.

source: Ngh. My head...
cs: Ngh. Moje hlava...

source: Dead. Good.
cs: Mrtvý. Dobře.

source: Use
cs: Použít

source: This is the pool that thing came from-the parasite now writhling behind your eye.
cs: Tohle je to jezírko, ze kterého ta věc vylezla – ten parazit, co se ti teď svíjí za okem.

source: Leave.
cs: Odejít.

source: Restoration pods
cs: Obnovovací Moduly

source: You can use a restoration pod to fully recover your hit points and spell slots if you are hurt.
cs: Pokud jste zraněni, můžete použít Obnovovací Modul k plnému obnovení životů a pozic pro kouzla.

source: Odd. I fell.. better.
cs: Zvláštní. Cítím se.. lépe.

source: Open
cs: Otevřít

source: Close
cs: Zavřít

source: Loot
cs: Prohledat

source: Read
cs: Přečíst

source: Images of goblins- their habits and histories- flash into your mind.
cs: V hlavě se ti promítají obrazy goblinů – jejich zvyky a historie.

source: A chematic of a nautiloid flashes into your mind. Nerves, sinews, as much living being as ship.
cs: V hlavě se ti vybaví nákresy nautiloida. Nervy, šlachy, stejně tak živá bytost jako loď.

source: A thousand years of humanoid history- elves, swarves, humans and more- flash behind your eyes.
cs: Před očima se ti promítne tisíce let humanoidní historie – elfů, Trpaslíků, lidí a dalších.

source: Abomination. this is your end.
cs: Zrůdo, tohle je tvůj konec.

source: Your head throbs and your skin tingles. Visions rush past:a dragon wing a silver sword-and a flash of your face seen through the strange womans eyes.
cs: Hlava ti třeští a kůže brní. Před očima se mihnou vidiny: dračí křídla, stříbrný meč – a záblesk tvé vlastní tváře, viděný skrze oči té neznámé ženy.

source: My head. what is this... ngh.
cs: Moje hlava. Co to je... ngh.

source: Tskva. You are no thrall-Vlaakith blesses me this day! Together we might survive.
cs: Tskva. Ty nejsi žádný otrok – Vlaakith mi žehnej! Společně bychom mohli přežít.

source: We need to figure out where we are.
cs: Musíme zjistit, kde jsme.

source: We can do nothing until we escape-that must be our priority.
cs: Nemůžeme dělat nic, dokud neunikneme – to musí být naše priorita.

source: First, we exterminate the imps, Then we find the helm and take control of the ship.
cs: Nejprve vyhladíme ty impy, pak najdeme kormidlo a převezmeme kontrolu nad lodí.

source: We will adrdress the matter of a cure for this infection once we reach the Material Plane.
cs: Záležitost léčby na tuto infekci vyřešíme, jakmile dosáhneme Materiální sféry.

source: Move to
cs: Přesunout se

source: Main Hand Attack
cs: Útok primární zbraní

source: End turn
cs: Konec kola

source: Your turn
cs: Tvé kolo

source: You prove surprisingly adequate in the battle..
cs: V boji si vedeš překvapivě obstojně.

source: Now-to he helm.
cs: Ale teď ke kormidlu.

source: The ship wont be able to take another dragon attack. We need to get out before its too late.
cs: Loď už další dračí útok nevydrží. Musíme se odsud dostat, než bude příliš pozdě.

source: Istik-back! Touch nothing without knowing its purpose.
cs: Zpátky istiku! Nesahej na nic čemu nerozumíš.

source: Damm it!.
cs: Sakra!

source: You! Get me out of this damm thing!.
cs: Ty! Dostaň mě z téhle zatracené věci!.

source: We have no time for strugglers.
cs: Nemáme čas na slabé kusy.

source: Ill go look around- there must be some way to get this thing open.
cs: Jdu se porozhlédnout – musí existovat nějaký způsob, jak tu věc otevřít.

source: Try that contraption just nest to the pod-they did something to it when they sealed me in.
cs: Zkus ten aparát hned vedle modulu – něco s ním udělali, když mě tu zavřeli.

source: Hurry! Please!.
cs: Rychle! Prosím!.

source: The console appears dormant.
cs: Konzole se zdá být neaktivní.

source: Theres a socket in the console, shaped like the rune you found. insert it.
cs: V konzoli je otvor ve tvaru runy, kterou jsi našel. Vlož ji.

source: The console hums to life.
cs: Konzole s hučením ožila.

source: Place your hand on the console.
cs: Přilož ruku na konzoli.

source: Suddenly you feel a hideous squirming in your head. the parasite.
cs: Náhle v hlavě ucítíš odporné svíjení. Ten parazit.

source: Then discomfort fades, and another sensation washes over you. Conection. Authority.
cs: Poté nepříjemný pocit ustoupí a zaplaví tě jiný vjem. Spojení. Autorita.

source: Will the pod to open.
cs: Přikaž modulu, ať se otevře.

source: You feel the biomechanical brain of the console process your comand and yield to it.
cs: Cítíš, jak biomechanický mozek konzole zpracovává tvůj příkaz a podvoluje se mu.

source: A shiver runs across your mind... You feel sated.
cs: Myslí ti přeběhne mráz... Cítíš se nasycen.

source: At last... thought i was done for.
cs: Konečně... Myslela jsme, že je se mnou konec.

source: I thought that damn thing was going to be my coffin. Thank you-
cs: Myslela jsem, že ta zatracená věc bude moje rakev. Děkuji-

source: Your mind lurches into her thoughts. Her gratitude is mixed with warines-because you have a gith with you.
cs: Tvá mysl se prudce ponoří do jejích myšlenek. Její vděčnost se mísí s obezřetností – protože máš s sebou githyanku.

source: You keep dangerouse company.
cs: Vybíráš si nebezpečnou společnost.

source: Got a problem with githyanki?
cs: Máš problém s githyanki?

source: More that gith have a problem with everyone else. But theres more important matters right now-survival.
cs: Spíš mají githové problém se všemi ostatními. Ale teď jsou tu důležitější věci – přežití.

source: let me come with you. We can get out off this ship, and watch each others backs along the way.
cs: Nech mě jít s tebou. Můžeme se z téhle lodi dostat a po cestě si navzájem krýt záda.

source: All right then, lets get going. im Tav.
cs: Tak dobře, pojďme. Jsem Tav.

source: Shadowhearth. One moment....
cs: Shadowhearth. malý moment...

source: Come on, time to go.
cs: Pojď, je čas jít.

source: Finally. Let us meka for the helm-weve wasted enough time already.
cs: Konečně. Vyrazme ke kormidlu – už tak jsme ztratili dost času.

source: Shes right. Lead on.
cs: Má pravdu. Jdi první.

source: We are nearing the helm. Once inside, do as i say.
cs: Blížíme se ke kormidlu. Jakmile budeme uvnitř, dělejte co říkám.

source: Who put you in charge? ill trust my own judgement.
cs: Kdo říkal že rozhoduješ ty? Budu se řídit vlastním úsudkem.

source: Thrall. Connect the nerves of the transponder. We must escape. Now.
cs: Otroku. Propoj nervy transpondéru. Musíme uniknout. Hned.

source: Do it. We will deal with the ghaik after we escape.
cs: Udělěj to. s Ghaiky se vypořádáme, až unikneme.

source: The helms alien transponder-youve made it in time.
cs: Řídící mimozemský transpondér– stihl jsi to včas.
