Repository: Hynek-loc/game-localization-portfolio
Catalog: Witcher2 Ending-*-CZ loc sample.po
Languages: cs

source: Took you a while...
cs: Dal sis načas...

source: Is that bauble from Síle's megascope?
cs: To je krystal ze Sílina megaskopu?

source: Mhm. My final prank... I switched the diamonds. The one in the megascope has a flaw - minute, but just large enough to warp the teleport. The Emperor's magic theorists assured me the effect would be spectacular.
cs: Mhm. Můj poslední žert…. Vyměnil jsem diamanty. Ten v megaskopu má nepatrnou vadu, ale dost velkou na to poškodit teleport. Císařovi magičtí teoretici mě ujistili že efekt bude velkolepý.

source: I let her escape.
cs: Nechal jsme ji utéct.

source: You're heartless. You've no idea what the royal witch-hunters have in store for her. A lot of pain for a long time...
cs: Nemáš srdce. Nemáš ponětí co pro ní mají královští lovci čarodějnic připravené. Dlouhá léta plná bolesti...

source: I don't doubt it. So, ready to lay your cards out on the table?
cs: O tom nepochybuji. Takže, připraven vyložit karty na stůl?

source: Oh, it was.
cs: Oh, to byl.

source: Good. Had she lived, she would've suffered more intensely and much longer. She helped me quite a bit, through naiveté and pride. I would not have gotten far without her.
cs: Dobře. Kdyby přežila, trpěla by intenzivněji a mnohem déle. Dost mi pomohla, svou naivitou a pýchou. Bez ní bych se daleko nedostal.

source: Hm. So, ready to lay your cards out on the table?
cs: Hm, takže, připraven vyložit karty na stůl?

source: No matter the game, there comes a point when all the players need to show their cards. I love that moment. But first...
cs: Ať už jde o jakoukoliv hru, vždy přijde čas kdy musí všichni hráči ukázat své karty. Ten moment miluji. Ale nejdřív...

source: Vodka?
cs: Vodku?

source: I only drink with friends.
cs: Já piju jen s přáteli.

source: What about old acquaintances? Heh...
cs: A co staří známí? Heh...

source: I suppose my throat's a little dry.
cs: Možná mám trochu vyschlo v krku.

source: In that case, let's drink to old friendships.
cs: V tom případě si připijme na staré přátelství.

source: Recovered your memory yet?
cs: Už se ti vrátila paměť?

source: Not entirely.
cs: Ne úplně.

source: Remember how we first met?
cs: Pamatuješ si, jak jsme se potkali poprvé?

source: Yeah. I saved your life. Couldn't think of a nicer way to pay me back?
cs: Jo. Zachránil jsem ti život. Nenapadl tě lepší způsob, jak se mi odvděčit?

source: Frankly, I couldn't. I mean, taking care of another man's woman... Yennefer. I can't fathom what you saw in her, but I suppose there's no accounting for taste...
cs: Upřímně, nemohl. Myslím tím, jak jsem se staral o ženu někoho jinýho... Yennefer. Nechápu, co jsi na ní viděl, ale proti gustu žádný dišputát...

source: Back with me, friend? Got the feeling you left for a minute...
cs: Jsi zpátky, příteli? Měl jsem pocit, že jsi na chvíli mimo...

source: Memories... I remember the Hanged Man's Tree and the Wild Hunt. I remember the exchange - me for Yennefer.
cs: Vzpomínky... Pamatuju si Strom Oběšenců a Divoký hon. Pamatuju si tu výměnu-já za Yennefer.

source: So, cards out on the table. Unless you chased me all that way just to kill me...
cs: Takže, karty jsou na stole, Ledaže jsi mě hnal takovou dálku jen proto, abys mě zabil...

source: I chased you for lots of reasons. You owe me - some explanations, to start with.
cs: Naháněl jsem tě z mnoha důvodů. Dlužíš mi vysvětlení-pro začátek.

source: Let's say I do.
cs: Řekněmě že ano.

source: Why are you still here? Why did you wait for me this time?
cs: Proč si stále tady? Proč si na mě tentokrát čekal?

source: I knew you wouldn't give up, I knew you'd pursue me. And I don't aim to hide anymore.
cs: Věděl jsem, že to nevzdáš, že mě budeš pronásledovat. A já už se nehodlám dál schovávat.

source: This story ends here and now.
cs: Tenhle příběh končí teď a tady.

source: Tell me about Yennefer. What happened after I departed?
cs: Řekni mi o Yennefer. Co se stalo, když jsem odjel?

source: She was feverish for several days, delirious, in agony. Somehow she recovered, but she had amnesia. Like you.
cs: Několik dní měla horečku, blouznila a trpěla. Nakonec se z toho dostala, ale ztratila paměť. Jako ty.

source: What then?
cs: Co bylo dál?

source: We wandered the Empire. Everywhere we went, she got in trouble and we pulled her out.
cs: Toulali jsme se po Impériu. Dostala se do maléru kamkoliv jsme přišli a my ji z něj tahali ven.

source: Then the Imperial secret police captured us.
cs: Pak nás zajala Imperiální tajná policie.

source: Imperial secret police?
cs: Imperiální tajná policie?

source: That's how I met Vattier de Ridaux. And the Emperor himself.
cs: Tak jsem poznal Vattiera de Rideaux. A samotného císaře.

source: What happened to Yennefer?
cs: Co bylo s Yennefer?

source: I never saw her again. The Emperor sent me north. She stayed behind.
cs: Už jsem jí nikdy neviděl. Císař mě poslal na sever. Ona zůstala.

source: So she's in the Empire.
cs: Takže je v Impériu.

source: She was when I left.
cs: Byla když jsem odešel.

source: I've learned all I wanted to know. Your death won't change a thing. Go where you will.
cs: Už vím vše co jsem vědět chtěl. Tvoje smrt nic nezmění. Jdi si kam chceš.

source: Just like that? No threats? No words of wisdom?
cs: Jen tak? Žádné vyhrožování? Žádná moudra na cestu?

source: You going or not?
cs: Tak jdeš nebo ne?

source: Huh. Farewell, Geralt.
cs: Huh. Sbohem, Geralte.
